11/data/attachments/dcc7fa5b25f7d4f9.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_4a12cc2e-af0c-4da1-be21-c2e5a632d439</nif:username>
            <nif:friendToBeAdded>Joseph_want_Friend_43904_0</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>